Revit 2024 API
PDFExportOptions.IsValidNamingRule Method
 Whether naming rule is valid or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData> namingRule
)
Visual Basic
Public Shared Function IsValidNamingRule ( _
	namingRule As IList(Of TableCellCombinedParameterData) _
) As Boolean
Visual C++
public:
static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData^>^ namingRule
)
Parameters
namingRule
Type: System.Collections.Generic.IList<TableCellCombinedParameterData>
 The naming rule to be validated.
Return Value
 Whether or not the name is valid.
Remarks
 If true, this naming rule is a valid. If false, this naming rule is not valid for empty naming rule or illegal characters, such as
CopyC#
\ / : * ? " < >
.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace